---
kind: enumMember
id: F:Autodesk.Revit.DB.Macros.DocumentMacroOptions.DisableMacros
enum: Autodesk.Revit.DB.Macros.DocumentMacroOptions
source: html/718074d4-9235-9eb1-c8b1-e1d4bb9dddc6.htm
---
# Autodesk.Revit.DB.Macros.DocumentMacroOptions.DisableMacros

The option to disable macros in the document.